package com.example.horo_tree.Auth;

import com.example.horo_tree.R;
import com.example.horo_tree.model.horo;

public class calculate_horo {
    private horo horo;
    private int date;
    private int month;

    public calculate_horo(int date, int month) {
        this.date = date;
        this.month = month;
    }

    public horo calculate(){
        if(((date>=16&&date<=31) && month==12) || ((date>=1 && date<=14)&&month==1)){
            horo=new horo("ราศีธนู", R.drawable.sagittarius, "คนเกิดราศีนี้ส่วนใหญ่มักเป็นคนที่มีนิสัยซื่อตรง พูดจริงทำจริง เวลาทำสิ่งใดมักทำจริง มีความทะเยอทะยานใฝ่สูง ชอบอิสรเสรี ไม่ชอบให้ใครมาบังคับมากเกินไป");
        }else if(((date>=15 && date <=31) && month==1) || ((date>=1 && date<=12)&&month==2)){
            horo=new horo("ราศีมังกร",R.drawable.capricornus, "คนเกิดราศีนี้ส่วนใหญ่มักเป็นคนที่มีนิสัยชอบการต่อสู้ มีความอดทน รวมไปถึงการมีไหวพริบดี ว่องไว ชอบถ่อมตัว ถือดี ไม่สนใจในการแต่งกาย มีความรู้ดี ฉลาดเป็นกรดอีกด้วย");
        }else if(((date>=13 && date <=29) && month==2) || ((date>=1 && date<=14)&&month==3)){
            horo=new horo("ราศีกุมภ์",R.drawable.aquarius, "คนเกิดราศีนี้ส่วนใหญ่มักเป็นคนที่มีนิสัยช่างคิด ใฝ่ฝันถึงความสำเร็จในกิจการอาชีพของตน มีความฉลาดรอบคอบ ใจคอเยือกเย็นชอบอิสระไม่ชอบให้ใครเข้ามาเจ้ากี้เจ้าการกับชีวิตของตัวเอง");
        }else if(((date>=15 && date <=31) && month==3) || ((date>=1 && date<=12)&&month==4)){
            horo=new horo("ราศีมีน",R.drawable.pisces, "คนเกิดราศีนี้ส่วนใหญ่มักเป็นคนที่มีนิสัยมักได้โลภมาก ใจแปรปรวน ทำงานหยิบโหย่งจับจรด ขาดความรอบคอบ ชีวิตขาดความมั่นคง ทำอะไรไม่เป็นหลักแหล่ง");
        }else if(((date>=13 && date <=30) && month==4) || ((date>=1 && date<=14)&&month==5)){
            horo=new horo("ราศีเมษ",R.drawable.aries, "คนเกิดราศีนี้ส่วนใหญ่มักเป็นคนที่มีนิสัยชอบการเรียนรู้ และหมั่นศึกษาหาความรู้ต่าง ๆ อยากรู้ อยากเห็น มีเค้าโครงมาก ชอบการประดิษฐ์ด้านวิทยาศาสตร์ละไฟฟ้า มักตกใจง่าย หรือชอบตื่นตูมอยู่เสมอ");
        }else if(((date>=15 && date <=31) && month==5) || ((date>=1 && date<=14)&&month==6)){
            horo=new horo("ราศีพฤษภ",R.drawable.taurus, "คนเกิดราศีนี้ส่วนใหญ่มักเป็นคนที่มีนิสัยอดทน มุมานะบึกบึน มีความลุ่มหลงงมงาย ชอบยกตนข่มท่าน มักเป็นคนที่มีความเฉื่อยชา ไม่มีความกระตือรือร้นร้นในการทำสิ่งต่างๆมากนัก");
        }else if(((date>=15 && date <=30) && month==6) || ((date>=1 && date<=14)&&month==7)){
            horo=new horo("ราศีเมถุน",R.drawable.gemini, "คนเกิดราศีนี้ส่วนใหญ่มักเป็นคนที่มีนิสัยปราดเปรียวว่องไว แต่มักเป็นคนใจอ่อน ไม่มีความแน่นอน ชอบทางกามารมณ์ บางครั้งมักมีความหมกมุ่นมากเกินไป");
        }else if(((date>=15 && date <=31) && month==7) || ((date>=1 && date<=15)&&month==8)){
            horo=new horo("ราศีกรกฎ",R.drawable.cancer, "คนเกิดราศีนี้ส่วนใหญ่มักเป็นคนที่ที่มีนิสัยเฉื่อยชา เชื่องช้า อุ้ยอ้าย เจ้าระเบียบแบบแผน จู้จี้จุกจิก แต่ก็มีความโอบอ้อมอารี และชอบให้การช่วยเหลือผู้อื่นอยู่เสมอๆ");
        }else if(((date>=16 && date <=31) && month==8) || ((date>=1 && date<=16)&&month==9)){
            horo=new horo("ราศีสิงห์",R.drawable.leo, "คนเกิดราศีนี้ส่วนใหญ่มักเป็นคนที่มีนิสัยทะเยอทะยานใฝ่สูง ใจแน่วแน่ ชอบอิสระเสรี ใจเด็ดเดี่ยว วางท่าทางน่าเกรงขาม สามารถเป็นที่พึ่งพาของคนรอบข้างได้เป็นอย่างดี");
        }else if(((date>=17 && date <=30) && month==9) || ((date>=1 && date<=16)&&month==10)){
            horo=new horo("ราศีกันย์",R.drawable.virgo, "คนเกิดราศีนี้ส่วนใหญ่มักเป็นคนที่มีนิสัยสงบเสงี่ยม ชอบทำตามอารมณ์ มีความขยันขันแข็งหมั่นเพียร ช่างคิด ช่างประดิษฐ์ และมักมีความคิดในการทำงานใหม่ๆอยู่เสมอ");
        }else if(((date>=17 && date <=31) && month==10) || ((date>=1 && date<=15)&&month==11)){
            horo=new horo("ราศีตุลย์",R.drawable.libra, "คนเกิดราศีนี้ส่วนใหญ่มักเป็นคนที่มีนิสัยซื่อสัตย์ ชอบศึกษาวิยาการต่าง ๆ มีความเฉลียวฉลาดรอบคอบ ทำสิ่งใดก็มักจะประสบความสำเร็จมากกว่าคนอื่นๆ");
        }else if(((date>=16 && date <=30) && month==11) || ((date>=1 && date<=15)&&month==12)){
            horo=new horo("ราศีพิจิก",R.drawable.scorpio, "คนเกิดราศีนี้ส่วนใหญ่มักเป็นคนที่มีนิสัยลึกลับ ชอบปกปิดความลับ มีความพลิกแพลง มีความรอบคอบดี หากได้รับมอบหมายให้ทำสิ่งใดก็จะสามารถทำออกมาได้ดี ช่วยให้เป็นที่ยอมรับอยู่เสมอ");
        }

        return horo;
    }
}
